app/controllers/api/calendars_controller.rb

SELECT "calendars".* FROM "calendars" ORDER BY "calendars"."created_at" DESC
---
    def index
      @events = Calendar.order(created_at: :desc)

INSERT INTO "calendars" ("title", "body", "location", "start_time", "end_time", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
    def create
      @event = Calendar.new(calendar_params)
      respond_to do |format|
        if @event.save

SELECT  "calendars".* FROM "calendars" WHERE "calendars"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
      @event = Calendar.find(params[:id])