app/views/home/calendar.html.erb

                  <% if event.start_time == day || (day > event.start_time && day <= event.end_time) %>
                    <% @single_event = Calendar.find(event.id) %>
---
SELECT  "calendars".* FROM "calendars" WHERE "calendars"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]