app/controllers/home_controller.rb

SELECT "calendars".* FROM "calendars" ORDER BY "calendars"."start_time" ASC
---
  def calendar
    # Make today dynamic so we can switch months in the view
    @today = params[:date] ? Date.parse(params[:date]) : Date.today
    # First day is the first Sunday that includes the beginning of the month
    first_day = @today.beginning_of_month.beginning_of_week
    # Last day is the last Saturday that includes the end of the month
    last_day = @today.end_of_month.end_of_week
    # Weeks is an array of arrays, each of length 7, which contain full weeks i.e. Sun-Sat
    @weeks = (first_day..last_day).to_a.in_groups_of(7)
    # Events by date is all events ordered by start time
    @events_by_date = Calendar.all.order(:start_time)